---
kind: type
id: T:Autodesk.Revit.DB.Structure.FabricSheetAlignment
source: html/c717132f-ecfd-8e66-2cf2-e81282ef3d7d.htm
---
# Autodesk.Revit.DB.Structure.FabricSheetAlignment

Fabric Sheet alignment in the fabric distribution

## Syntax (C#)
```csharp
public enum FabricSheetAlignment
```